# -*- coding: utf-8 -*-
import json
def create_chinese_font():
    result = []
    data = "正月农历腊月无节气小寒大寒立春雨水惊蛰春分清明谷雨立夏小满芒种夏至小暑大暑立秋处暑白露秋分寒露霜降立冬小雪大雪冬至甲乙丙丁戊己庚辛壬癸子丑寅卯辰巳午未申酉戌亥闰月初周一二三四五六七八九十廿日晴少云晴间多云多云阴有风平静微风和风清风强风/劲风疾风大风烈风风暴狂爆风飓风热带风暴霾中度霾重度霾严重霾阵雨雷阵雨雷阵雨并伴有冰雹小雨中雨大雨暴雨大暴雨特大暴雨强阵雨强雷阵雨极端降雨毛毛雨/细雨雨小雨-中雨中雨-大雨大雨-暴雨暴雨-大暴雨大暴雨-特大暴雨雨雪天气雨夹雪阵雨夹雪冻雨雪阵雪小雪中雪大暴雪小雪-中雪中雪-大雪大雪-暴雪浮尘扬沙沙尘暴强沙尘暴龙卷风雾浓雾强浓雾轻雾大雾特强浓雾热冷未知南山区 ℃日多少云四川省广东省广安市深圳市南山区廿一二三四五六七八九十晴阴雨雾大小雪春夏秋冬立初正月星期周末中暴立春水惊蛰分清明谷满芒种至暑处暑白露秋分寒露霜降至寒子鼠丑牛寅虎卯兔辰龙巳蛇午马未羊申猴酉鸡戌狗亥猪甲乙丙丁戊己庚辛壬癸"
    for i in set(data):
        result.append(hex(ord(i)))
    print(",".join(result))



create_chinese_font()